{
  "type": "image",
  "url": "https://app.trickle.so/storage/public/images/usr_187a6ac988000001/4850d354-7ce2-4f9b-bc5d-2fd956fcf68f.jpeg",
  "description": "Use this single detailed prompt to generate a one‑page website that visually matches the full screenshot, with very accurate icons and colors:\n\nCreate a responsive single‑page medical website layout (desktop view) exactly matching the provided screenshot. Use a clean sans‑serif font (e.g. “Cairo” for Arabic and a simple Latin sans‑serif for English). Page width is similar to a mobile‑first narrow desktop (about 520–600px). Background color is pure white. Primary accent color is bright medical red #f03b3b. Secondary accent color is warm yellow #ffc928. Text color is almost black #111111. All sections are stacked vertically with clear card‑like separation and light shadows only where visible in the screenshot.\n\nTop navigation and hero:\n- At the very top, add a white horizontal navigation bar. On the left, place two small logos: first an abstract curved yellow and purple figure, second a round Kuwait Ministry of Health emblem in red and green. On the right of the nav, add three menu items in uppercase black text: “HOME”, “SIGN IN”, “ABOUT”, spaced evenly. No borders, just white background.\n- Directly below, add a large hero image of the hospital building spanning full width. Overlay white text in all caps “SURGICAL ONCOLOGY DEPARTMENT KCCC” positioned slightly above center, aligned left of the central area (as in the screenshot). Below this text, centered horizontally, place a pill‑shaped button with “REGISTER NOW” in uppercase black. Button is white, subtle drop shadow, border radius about 999px.\n- Keep a very thin white margin around the hero image, matching the screenshot. No extra headers.\n\nDoctor name strip:\n- Immediately under the hero, create a horizontal strip with a white background and a left‑aligned yellow square icon (approx 90x90px). Inside the yellow square, place a simple white user/doctor avatar icon (head and shoulders with a stethoscope). To the right of the icon, in two lines, add large bold black text “Dr. Khalid Hilal” and below it a smaller black subtitle “Head of surgical oncology department”. Align this text vertically center with the yellow icon.\n- The yellow color matches #ffc928 exactly; the doctor icon is flat white.\n\nFirst workshop block (GIT):\n- Below the doctor strip, create a two‑column area on white: left column approx 55% width, right column 45%.\n- In the left column, at the top, write in small uppercase red text: “THE 14TH GIT CANCER SURGERY WORKSHOP” and directly below it in smaller orange text “1‑5 February 2026”. Use the same red/orange combination from the screenshot (#f03b3b red and a slightly darker orange for the date).\n- Below this text, add a pill‑shaped “Speakers” control: a left yellow rounded rectangle chip containing a white speaker/sound waves icon, attached to a longer white rounded rectangle with the word “Speakers” in bold black. Make sure the yellow chip width is about 80px and the rest white part about 180px, overall center aligned.\n- Under the “Speakers” pill, add two speaker cards side by side. Each is a white rounded card with a thin black border and very subtle shadow. At the top left of each card, place a tiny circular flag: German flag for the first (horizontal black‑red‑gold stripes) and Egyptian flag for the second (red‑white‑black). Below each flag, show the speaker photo (rectangular). Under the photo, add the names “Prof.ayman Agha” and “Prof.Ahmd Shokry” in small black text, left aligned.\n- In the right column, add a tall workshop poster image with logos at the top, red main title “The 14th GIT Cancer Surgery Workshop”, smaller black text under it, two doctor photos, and sponsor logos at the bottom. Poster has a gray‑white abstract background, thin gray border, and a slight drop shadow.\n\nSecond workshop block (Head & Neck):\n- Under the first block, create another two‑column area similar in height. Left column: a tall poster with light background, same logos on top, red title “The 15th Head & Neck Cancer Surgery Workshop from the 4th to the 8th of January 2026”, multiple lines of smaller black text, two speaker photos near center, and a black‑on‑white QR code plus sponsor logos at the bottom. Poster border and shadow match the first.\n- Right column: at the top, a red uppercase heading text: “THE 14TH HEAD & NECK CANCER SURGERY WORKSHOP”. Directly beneath it, in smaller orange uppercase text, place the line “FROM THE 4TH TO THE 8TH OF JANUARY 2026”. The two lines are exactly as in the screenshot, aligned left within the right column.\n- Below this, add another pill‑shaped “Speakers” control identical to the first (yellow left chip with white speaker icon, white right pill with black “Speakers”).\n- Under the pill, add two more speaker cards side by side. Each is similar style with white background, black border, slight shadow. At the top of each card, place a small circular flag: USA flag for the first (stars and stripes) and UK flag for the second (Union Jack). Inside the cards place doctor photos. Under each photo, write the names “prof.Emad Kandil” and “prof.Almastair fry” in black, left aligned.\n\nWorkshop goals strip:\n- Beneath the workshop section, add a horizontal area with a very light gray background (#f5f5f5). On the right, position a small white rounded badge containing the red Arabic title “أهداف الورشة” and a red target icon with an arrow sticking out to the left of the text. To the left of this badge (occupying most width), stack four Arabic bullet lines (right‑aligned) describing the goals. Each line is black text. At the far right of each line, add a small yellow square with a black checkmark icon, aligned vertically; the checkmarks and text should form neat rows as in the screenshot.\n\nCenter description block (about the center):\n- Under the goals strip, add a full‑width white text block containing an Arabic paragraph. Start with the center name in red “مركز حسين مكي جمعة” followed by the rest of the paragraph in black. All text right‑aligned, using the same Arabic font and line spacing as in the screenshot. No borders, just top and bottom margin.\n\nMap card:\n- Directly below the paragraph, center a Google‑style map card (same width as paragraph). Map shows the coastal area with water in light blue and land in beige. Place a red circular pin with white “H” labeled “Husain Makki AlJuma Center for…” near the center. At the top right of the map show “Kuwait City” label. Add tilt indicator and “Map data ©2025” text at the bottom right. Card has rounded corners and a very light gray border.\n\nContact and footer section:\n- At the bottom, create a wide bright yellow (#ffc928) strip. On the left side, add a 3D white character holding a magnifying glass and standing next to a large red question‑mark icon (same style as screenshot). In the center of the yellow strip, place a small pill‑shaped white badge with red Arabic text “للاستفسار أو التسجيل”. Directly below it, in uppercase black, write “SAYED SALAMA”, and under that in very large bold black numerals write “51147478”.\n- On the right side of the yellow strip, place a large black‑and‑white QR code with square shape and a WhatsApp icon in its center. Leave some margin around it.\n- Below the yellow strip, add a narrow white footer bar with centered small black uppercase text: “© 2026 ALL RIGHTS RESERVED FOR AHMED SHEHATA NAGY.” No border above or below.\n\nMicro‑details and spacing:\n- Use consistent 8–12px padding around inner content and between sections, matching the screenshot’s compact vertical spacing.\n- Corner radius: cards and pills around 20–25px; map and posters slightly smaller radius.\n- Border colors mostly #d4d4d4 for cards and posters.\n- All icons are flat, simple monochrome (white icon on yellow, black checkmark on yellow, etc.), no gradients except on posters.\n\nAnimations (subtle and modern):\n- Fade‑in from bottom for each major section as the user scrolls down.\n- Slight hover lift and stronger shadow for speaker cards and posters.\n- Soft pulse animation on both “Speakers” pills and the “REGISTER NOW” button every few seconds.\n- Gentle up‑and‑down float for the red question‑mark icon and a subtle pulse glow for the phone number in the yellow strip.\n- Light zoom‑on‑hover for the hospital hero image and the map card.\n\nEnsure the final layout, icon placement, and color palette visually match the screenshot as closely as possible so the generated website looks almost identical to the reference."
}